sae/sae-webservices/src/main/resources/META-INF/SaeService.wsdl

<wsdl2:description xmlns:wsdl2="http://www.w3.org/ns/wsdl" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:tns="http://www.cirtil.fr/saeService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsoap="http://www.w3.org/ns/wsdl/soap" xmlns:wrpc="http://www.w3.org/ns/wsdl/rpc" xmlns:wsdlx="http://www.w3.org/ns/wsdl-extensions" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:whttp="http://www.w3.org/ns/wsdl/http" targetNamespace="http://www.cirtil.fr/saeService"><wsdl2:documentation>&#xd;
      Services offerts par le SAE aux applications&#xd;
      clientes&#xd;
   </wsdl2:documentation><wsdl2:types><schema xmlns="http://www.w3.org/2001/XMLSchema" xmlns:impl="http://www.cirtil.fr/saeService" xmlns:intf="http://www.cirtil.fr/saeService" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://www.cirtil.fr/saeService">
    <element name="PingRequest">
        <complexType />
    </element>
    <element name="PingResponse">
        <complexType>
            <sequence>
                <element name="pingString" type="xsd:string" />
            </sequence>
        </complexType>
    </element>
</schema></wsdl2:types><wsdl2:interface name="SaeServiceInterface"><wsdl2:operation name="Ping" pattern="http://www.w3.org/ns/wsdl/in-out" wsdlx:safe="false"><wsdl2:input element="tns:PingRequest" wsaw:Action="Ping" /><wsdl2:output element="tns:PingResponse" wsaw:Action="Ping" /></wsdl2:operation></wsdl2:interface><wsdl2:binding name="SaeServiceBinding" interface="tns:SaeServiceInterface" type="http://www.w3.org/ns/wsdl/soap" wsoap:version="1.2"><wsdl2:operation ref="tns:Ping" wsoap:action="Ping" /></wsdl2:binding><wsdl2:service name="SaeService" interface="tns:SaeServiceInterface"><wsdl2:endpoint name="SaeServiceEndpoint" binding="tns:SaeServiceBinding" address="http://localhost:8080/axis2/services/SaeService/" /></wsdl2:service></wsdl2:description>