saedemos/sae-webservices-client-demo/src/main/resources/soap/ping.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <ns1:PingRequest xmlns:ns1="http://www.cirtil.fr/saeService" />
   </soapenv:Body>
</soapenv:Envelope>