sae/sae-webservices-test/src/test/resources/soap/soap_success.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:To>http://Test/</wsa:To>
      <wsa:MessageID>urn:uuid:8D3795E3C9DACFB19C1302260147046</wsa:MessageID>
      <wsa:Action>Ping</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:PingRequest xmlns:ns1="http://www.cirtil.fr/saeService" />
   </soapenv:Body>
</soapenv:Envelope>